src/cf/Catalogs/Sets.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Sets</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SetTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Border</Name>
					<Type>
						<v8:Type>cfg:EnumRef.BorderTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReleaseDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Block</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GathererCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OldCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WithExtraData</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/SetBoosterComposition.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>SetBoosterComposition</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Set</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Sets</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CardNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CardType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CardTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/Sets/Ext/ObjectModule.bsl
Function UpdateData(GetExtra = False) Export
		
	ExtraSuffix = ?(GetExtra, "-x", "");
	
	// Set data
	SetName = ThisObject.Code + ExtraSuffix + ".json";
	SetData = MTGJSON.GetMTGData(SetName);
	
	BeginTransaction();
	
	ThisObject.Description 	= SetData.Get("name");
	
	gathererCodeString = SetData.Get("gathererCode");
	If NOT gathererCodeString = Undefined Then
		ThisObject.GathererCode = Number(gathererCodeString);
	EndIf;
	
	oldCodeString = SetData.Get("oldCode");
	If NOT oldCodeString = Undefined Then
		ThisObject.OldCode = Number(oldCodeString);
	EndIf;

	releaseDateString = SetData.Get("releaseDate");
	releaseDateString = StrReplace(releaseDateString, "-", "");	
	ThisObject.ReleaseDate 	= Date(releaseDateString);
	
	ThisObject.Block		= SetData.Get("block");
	
	SetTypeString = SetData.Get("type");
	ThisObject.Type = GeneralPurpose.EnumValueBySynonym("SetTypes", SetTypeString);
	
	BorderTypeString = SetData.Get("border");
	ThisObject.Border = GeneralPurpose.EnumValueBySynonym("BorderTypes", BorderTypeString);
	
	ThisObject.Write();
	
	// Booster data
	BoosterData = SetData.Get("booster");
	
	BoosterRecordSet = РегистрыСведений.SetBoosterComposition.СоздатьНаборЗаписей();
	BoosterRecordSet.Filter.Set.Set(ThisObject.Ref);
	
	index = 1;
	
	For Each BoosterPositionData In BoosterData Do
		
		If TypeOf(BoosterPositionData) = Type("Array") Then
			
			For Each BosterCardTypeData In BoosterPositionData Do
				BoosterCard = BoosterRecordSet.Add();
			
				BoosterCard.Set 		= ThisObject.Ref;
				BoosterCard.CardType 	= GeneralPurpose.EnumValueBySynonym("CardTypes", BosterCardTypeData);
				BoosterCard.CardNumber	= index;					
				
			EndDo;
			
		Else
			BoosterCard = BoosterRecordSet.Add();
			
			BoosterCard.Set 		= ThisObject.Ref;
			BoosterCard.CardType 	= GeneralPurpose.EnumValueBySynonym("CardTypes", BoosterPositionData);
			BoosterCard.CardNumber	= index;
		EndIf;
		
		index = index + 1;
		
	EndDo;
	
	BoosterRecordSet.Write();
	
	// Cards data
	
	CommitTransaction();
	
EndFunction
